# if __name__ == '__main__':

# У кожному Python-файлі (модулі) інтерпретатор створює спеціальну змінну __name__.
# Якщо файл запущений безпосередньо (python myfile.py), то __name__ автоматично отримує значення:
# "__main__"
# Якщо файл імпортують з іншого файлу, то __name__ дорівнює імені модуля (тобто імені файлу без .py).    

# if __name__ == "__main__":
    # some_method()# цей код виконається тільки при прямому запуску файлу
    
# Навіщо це потрібно
# Відокремлення коду "для запуску" від коду "для імпорту"
# В файлі може бути і бібліотека (функції/класи), і тестовий/демо-код.
# Щоб при import mymodule виконувалася лише бібліотека, а не демо-код, його ховають у if __name__ == "__main__":.
# Зручність повторного використання
# Той самий файл можна і запускати напряму, і використовувати як модуль у іншому коді.    

# file: mymath.py

# def add(a, b):
#     return a + b

# def mul(a, b):
#     return a * b

# if __name__ == "__main__":
#     # Цей блок виконається тільки якщо ми запускаємо mymath.py напряму
#     print("Тестуємо mymath:")
#     print(add(2, 3))  # 5
#     print(mul(2, 3))  # 6
# Якщо виконати python mymath.py → виведе тести.

# Якщо зробити import mymath в іншому файлі → імпортуються тільки add і mul, але блок із тестами не виконається.